namespace Task_14_04
{
    internal class Program
    {
        /*
         * Определите класс User, который будет иметь статическое свойство CurrentUser, 
         * представляющее текущего пользователя, и метод для его установки.
        */
        static void Main(string[] args)
        {
            User.SetCurrentUser("Bob");
            Console.WriteLine(User.CurrentUser);
        }
    }
}
